---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectShapeReferenceOptions
source: html/ffd7166b-1532-164e-ea24-b78e0bb29d78.htm
---
# DirectShapeReferenceOptions Methods

Retrieves the ExternalGeometryId associated with the reference object.